/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_put_x.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: igbocha3 <igbocha3@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/02/17 23:50:33 by igbocha3          #+#    #+#             */
/*   Updated: 2022/02/28 10:04:47 by igbocha3         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Шестнадцатиричное целое число без знака

#include "ft_printf.h"

int	ft_put_x(long long int x, char c)
{
	int	d;

	d = ft_len_x(x);
	if (x >= 16)
		ft_put_x(x / 16, c);
	if (c == 'x')
		ft_put_c("0123456789abcdef"[x % 16]);
	if (c == 'X')
		ft_put_c("0123456789ABCDEF"[x % 16]);
	return (d);
}
